Feature: Визуализиране на налични книги

  Background: Отваряне на приложението
    Given Отваряне на приложението

  Scenario: Отваряне на начален екран с налични книги
    Then Визуализира се списък с категории
    And Визуализира списък с наличните 11 книги

  Scenario: Отваряне на начален екран с книги с избор на категория
    When потребителя избере категория: "Трилър"
    Then Визуализира списък с наличните 3 книги

  Scenario Outline: Отваряне на начален екран с книги с търсене по име на книга
    When потребителя въвежда име на книгата <име> в полето за търсене
    And натиска бутона за търсене
    Then Визуализира списък с наличните <брои> книги
    Examples:
      | име                               | брои |
      | "Институтът"                      | 1    |
      | ""                                | 11    |
      | "         "                       | 11    |
      | ";);&(<(<**d$^^;%*'*&f#$$><*^&)(*)(;(<%" | 0    |

  Scenario Outline: Отваряне на начален екран с книги с търсене по име на автор
    When потребителя въвежда име на автор <име> в полето за търсене
    And натиска бутона за търсене
    Then Визуализира списък с наличните <брои> книги
    Examples:
      | име                               | брои |
      | "Стивън Кинг"                     | 2    |
      | ""                                | 11    |
      | "         "                       | 11    |
      | ";);&(<(<**d$^^;%*'*&f#$$><*^&)(*)(;(<%" | 0    |

  Scenario Outline: Отваряне на начален екран с книги с търсене по година на книга
    When потребителя въвежда година на книга <година> в полето за търсене
    And натиска бутона за търсене
    Then Визуализира списък с наличните <брои> книги
    Examples:
      | година                               | брои |
      | 2000                    | 1    |
      | -12                       |0   |
    |0                          |11   |



