Feature: Оценяване на книга

  Background: Отваряне на приложението
    Given Потребителят отваря детайли на книга "Институтът"

  Scenario: Успешно оценяване на книга
    When избира 5 звезди
    And Въвежда коментар "Книгата е супер"
    And Натиска бутона оцени
    Then Вижда съобщение "Успешно оценихте с 5 звезди книгата Институтът"

  Scenario: Успешно оценяване на книга без коментар
    When избира 5 звезди
    And Натиска бутона оцени
    Then Вижда съобщение "Успешно оценихте с 5 звезди книгата Институтът"

  Scenario: Успешно оценяване на книга без оценка
    When Въвежда коментар "Книгата е супер"
    And Натиска бутона оцени
    Then Вижда съобщение "Въведете оценка"

  Scenario Outline: Оценяване на книга
    When избира <оценка> звезди
    And Въвежда коментар <коментар>
    And Натиска бутона оцени
    Then Вижда съобщение <съобщение>
    Examples:
      | оценка | коментар                                              | съобщение                                             |
      | 5      | "Книгата е супер"                                     | "Успешно оценихте с 5 звезди книгата Институтът"           |
      | 2      | "Книгата е супер"                                     | "Успешно оценихте с 2 звезди книгата Институтът"           |
      | -5     | "Книгата е супер"                                     | "Оценката трябва да е между 1 и 6"                    |
      | 1      | "Книгата е супер:)>"                                  | "За коментари може да ползвате букви, цифри и '.,!-'" |
      | 1      | "Книгата е супер1234567890123456789012345678901234567890" | "Коментарът трябва да е с дължина под 51"         |
